jnsbyr/esp8266-intexsbh20/PureSpaIO.cpp
    case FRAME_DIGIT::POS_2:
      //DEBUG_MSG("2");
      if (isrState.receivedDigits == DIGIT::POS_1)
      {
        isrState.displayValue = (isrState.displayValue & 0xFFFF00FFU) + (digit << 8);
        isrState.receivedDigits |= DIGIT::POS_2;
      }
      break;

    case FRAME_DIGIT::POS_3:
      //DEBUG_MSG("3");
      if (isrState.receivedDigits == DIGIT::POS_1_2)
      {
        isrState.displayValue = (isrState.displayValue & 0xFF00FFFFU) + (digit << 16);
        isrState.receivedDigits |= DIGIT::POS_3;
      }
      break;

    case FRAME_DIGIT::POS_4:
      //DEBUG_MSG("4");
      if (isrState.receivedDigits == DIGIT::POS_1_2_3)
      {
        isrState.displayValue = (isrState.displayValue & 0x00FFFFFFU) + (digit << 24);
        isrState.receivedDigits = DIGIT::POS_ALL;
      }
      break;
  }

  if (isrState.receivedDigits == DIGIT::POS_ALL)
  {
    if (isrState.displayValue == isrState.latestDisplayValue)
    {
      // display is stable, might be blinking
      //DEBUG_MSG(" s%x", isrState.displayValue);
      isrState.stableDisplayValueCount--;
      if (isrState.stableDisplayValueCount == 0)
      {
        //DEBUG_MSG(" C"); // confirmed
        isrState.stableDisplayValueCount = CONFIRM_FRAMES::REGULAR;
        if (isrState.isDisplayBlinking)
        {
          //DEBUG_MSG("B");
          if (diff(state.frameCounter, isrState.lastBlankDisplayFrameCounter) > BLINK::STOPPED_FRAMES)
          {
            // blinking is over, clear desired temp
            //DEBUG_MSG("b");
            isrState.isDisplayBlinking = false;
            isrState.latestBlinkingTemp = UNDEF::UINT;
          }
        }

        if (!displayIsError(isrState.displayValue))
        {
          // display does not show an error
          //DEBUG_MSG("e");
#ifdef MODEL_SJB_HS
          if (displayIsTime(isrState.displayValue))
          {
            // display shows a time
            //DEBUG_MSG("C");
            if (isrState.displayValue == isrState.latestDisinfectionTime)
            {
              // new time is stable
              //DEBUG_MSG("C%d", stableWaterTempCount);
              isrState.stableDisinfectionTimeCount--;
              if (isrState.stableDisinfectionTimeCount == 0)
              {
                // save time
                if (state.disinfectionTime != isrState.displayValue)
                {
                  //DEBUG_MSG(" AC ");
                  state.disinfectionTime = isrState.displayValue;
                }

                isrState.stableDisinfectionTimeCount = CONFIRM_FRAMES::REGULAR;
              }
            }
            else
            {
              // time has changed
              //DEBUG_MSG("c");
              isrState.latestDisinfectionTime = isrState.displayValue;
              isrState.stableWaterTempCount = CONFIRM_FRAMES::NOT_BLINKING;
            }
          }
          else
#endif
          {
            if (displayIsTemp(isrState.displayValue))
            {
              // display shows a temperature
              //DEBUG_MSG("T");
              if (isrState.isDisplayBlinking)
              {
                // display is blinking
                //DEBUG_MSG("B");
                if (isrState.displayValue == isrState.latestBlinkingTemp)
                {
                  // blinking temp is stable
                  isrState.stableBlinkingWaterTempCount++;
                  //DEBUG_MSG("DS ");
                }
                else if (diff(state.frameCounter, isrState.lastBlankDisplayFrameCounter) < BLINK::TEMP_FRAMES)
                {
                  // blinking temp has changed (is read after a blank screen and set at next black screen)
                  //DEBUG_MSG("DC ");
                  isrState.latestBlinkingTemp = isrState.displayValue;
                  isrState.stableBlinkingWaterTempCount = 0;
                }
              }
              else
              {
                // display is not blinking
                //DEBUG_MSG("b");
                if (isrState.displayValue == isrState.latestWaterTemp)
                {
                  // new actual temp is stable
                  //DEBUG_MSG("A ");
                  isrState.stableWaterTempCount--;
                  if (isrState.stableWaterTempCount == 0)
                  {
                    // save actual temp
                    if (state.waterTemp != isrState.displayValue)
                    {
                      //DEBUG_MSG(" T");
                      state.waterTemp = isrState.displayValue;
                    }

                    isrState.stableWaterTempCount = CONFIRM_FRAMES::NOT_BLINKING;
                  }
                }
                else
                {
                  // actual temp is changed
                  //DEBUG_MSG("a ");
                  isrState.latestWaterTemp = isrState.displayValue;
                  isrState.stableWaterTempCount = CONFIRM_FRAMES::NOT_BLINKING;
                }
              }
            }
            else
            {
              // unsupported display state (no error, no temperature)
              //DEBUG_MSG("t ");
            }
          }
        }
        else
        {
          // display shows error code
          state.error = display2Error(isrState.displayValue);
        }
      }
    }
    else if (displayIsBlank(isrState.displayValue))
    {
      // display is blank
      if (isrState.stableDisplayBlankCount)
      {
        isrState.stableDisplayBlankCount--;
      }
      else
      {
        // display is blank
        //DEBUG_MSG("B");
        if (isrState.isDisplayBlinking)
        {
          // already blinking
          if (isrState.latestBlinkingTemp != UNDEF::UINT)
          {
            // new temp
            //DEBUG_MSG("bc ");
            isrState.blankCounter++;
          }

          // if display was already blinking several times, save desired temp
          // otherwise could be start of error
          if (state.error == ERROR_NONE && isrState.blankCounter > 2
              && isrState.stableBlinkingWaterTempCount >= CONFIRM_FRAMES::REGULAR
              && state.desiredTemp != isrState.latestBlinkingTemp)
          {
            //DEBUG_MSG("\nDT%x ", isrState.displayValue);
            state.desiredTemp = isrState.latestBlinkingTemp;
          }

          isrState.latestBlinkingTemp = UNDEF::UINT;
          isrState.stableBlinkingWaterTempCount = 0;
        }
        else
        {
          // blinking start
          isrState.isDisplayBlinking = true;
          isrState.blankCounter = 0;
        }
        isrState.lastBlankDisplayFrameCounter = state.frameCounter;
      }
    }
    else
    {
      // display value changed
      isrState.latestDisplayValue = isrState.displayValue;
      isrState.stableDisplayValueCount = CONFIRM_FRAMES::REGULAR;
      isrState.stableDisplayBlankCount = CONFIRM_FRAMES::REGULAR;
    }
  }
  // else not all digits set yet
}

