jnsbyr/esp8266-intexsbh20/PureSpaIO.cpp
ICACHE_RAM_ATTR inline void PureSpaIO::decodeLED()
{
  if (isrState.frameValue == isrState.latestLedStatus)
  {
    // wait for confirmation
    isrState.stableLedStatusCount--;
    if (isrState.stableLedStatusCount == 0)
    {
      //DEBUG_MSG("\nL%x", frameValue);
      state.ledStatus = isrState.frameValue;
      state.buzzer = !(state.ledStatus & FRAME_LED::NO_BEEP);
      state.stateUpdated = true;
      isrState.stableLedStatusCount = CONFIRM_FRAMES::REGULAR;

      // clear buttons if buzzer is on
      if (state.buzzer)
      {
        buttons.toggleBubble = 0;
        buttons.toggleDisinfection = 0;
        buttons.toggleFilter = 0;
        buttons.toggleHeater = 0;
        buttons.toggleJet = 0;
        buttons.togglePower = 0;
        buttons.toggleTempUp = 0;
        buttons.toggleTempDown = 0;
      }
    }
  }
  else
  {
    // LED status changed
    isrState.latestLedStatus = isrState.frameValue;
    isrState.stableLedStatusCount = CONFIRM_FRAMES::REGULAR;
  }
}

ICACHE_RAM_ATTR inline void PureSpaIO::decodeButton()
{
  if (isrState.frameValue & FRAME_BUTTON::FILTER)
  {
    //DEBUG_MSG("F");
    if (buttons.toggleFilter)
    {
      isrState.reply = true;
      buttons.toggleFilter--;
    }
  }
  else if (isrState.frameValue & FRAME_BUTTON::HEATER)
  {
    //DEBUG_MSG("H");
    if (buttons.toggleHeater)
    {
      isrState.reply = true;
      buttons.toggleHeater--;
    }
  }
  else if (isrState.frameValue & FRAME_BUTTON::BUBBLE)
  {
    //DEBUG_MSG("B");
    if (buttons.toggleBubble)
    {
      isrState.reply = true;
      buttons.toggleBubble--;
      //if (!buttons.toggleBubble)
      //{
      //  DEBUG_MSG("\nFBO");
      //}
    }
  }
  else if (isrState.frameValue & FRAME_BUTTON::POWER)
  {
    //DEBUG_MSG(" P");
    if (buttons.togglePower)
    {
      isrState.reply = true;
      buttons.togglePower--;
    }
  }
  else if (isrState.frameValue & FRAME_BUTTON::TEMP_UP)
  {
    //DEBUG_MSG("U");
    if (buttons.toggleTempUp)
    {
      isrState.reply = true;
      buttons.toggleTempUp--;
    }
  }
  else if (isrState.frameValue & FRAME_BUTTON::TEMP_DOWN)
  {
    //DEBUG_MSG("D");
    if (buttons.toggleTempDown)
    {
      isrState.reply = true;
      buttons.toggleTempDown--;
    }
  }
#ifdef MODEL_SJB_HS
  else if (isrState.frameValue & FRAME_BUTTON::DISINFECTION)
  {
    if (buttons.toggleDisinfection)
    {
      isrState.reply = true;
      buttons.toggleDisinfection--;
    }
  }
  else if (isrState.frameValue & FRAME_BUTTON::JET)
  {
    if (buttons.toggleJet)
    {
      isrState.reply = true;
      buttons.toggleJet--;
    }
  }
#endif
  else if (isrState.frameValue & FRAME_BUTTON::TEMP_UNIT)
  {
    //DEBUG_MSG("T");
  }
  else
  {
    //DEBUG_MSG(" B%x", frameValue);
  }

  if (isrState.reply)
  {
    // delay around 5 µs relative to rising edge of latch signal before pulsing
    // pulse should be around 2 µs and must be completed before next falling edge of clock
#if F_CPU == 160000000L
    delayMicroseconds(1);
    pinMode(PIN::DATA, OUTPUT);
    delayMicroseconds(3);
    pinMode(PIN::DATA, INPUT);
#else
    #error 160 MHz CPU frequency required! Pulse timing not possible at 80 MHz, because the code above takes too long to reach this point.
    // at least using Arduino methods
#endif
    isrState.reply = false;
  }
}
